app/Controllers/Students.php

SELECT *
FROM `students`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Load the model
        $studentModel = new \App\Models\StudentModel();

        // Get real student data from DB
        $data['students'] = $studentModel->findAll();

DELETE FROM `students`
WHERE `id` IN ('22')
---
    public function delete($id)
    {
        if ($this->request->isAJAX()) {
            $studentModel = new \App\Models\StudentModel();
            $deleted = $studentModel->delete($id);